Revit 2027 API
BuiltInFailures.SketchFailures.RailingDoublyConnected Property
 Railings hosted on Stairs must form a single, open, connected line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RailingDoublyConnected { get; }
Public Shared ReadOnly Property RailingDoublyConnected As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RailingDoublyConnected {
	FailureDefinitionId^ get ();
}
static member RailingDoublyConnected : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace